'''
(2018년) KAKAO BLIND RECRUITMENT 블록 게임

'''

board = [
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,4,0,0,0],
    [0,0,0,0,0,4,4,0,0,0],
    [0,0,0,0,3,0,4,0,0,0],
    [0,0,0,2,3,0,0,0,5,5],
    [1,2,2,2,3,3,0,0,0,5],
    [1,1,1,0,0,0,0,0,0,5]
]

def check(b, x, y, v):
    if b[x+1][y] != v:
        return False
    if b[x+2][y] != v:

    else:
        

def solution(board):
    answer = 0
    return answer


solution(board)